
Archived entries from file nil


*** 
 #+BEGIN_SRC sql :engine postgresql :database tourney_practice
-- CREATE OR REPLACE FUNCTION player_OMW (integer) RETURNS TABLE (opponent int, opponent_OMW int) AS $$
--        select opposing_player, a.points FROM players_matches($1) JOIN player_tables as A
--        ON opposing_player = player_id
--        WHERE opposing_player IS NOT NULL;
-- $$ LANGUAGE SQL;

INSERT INTO matchez (match_id, tournament_name, round) VALUES (1, 'tennis', 1);
INSERT INTO matchez (match_id, tournament_name, round) VALUES (2, 'tennis', 1);
INSERT INTO matchez (match_id, tournament_name, round) VALUES (3, 'tennis', 1);
INSERT INTO matchez (match_id, tournament_name, round) VALUES (4, 'tennis', 1);


INSERT INTO playerz (player_name) VALUES ('a');
INSERT INTO playerz (player_name) VALUES ('b');
INSERT INTO playerz (player_name) VALUES ('c');
INSERT INTO playerz (player_name) VALUES ('d');
INSERT INTO playerz (player_name) VALUES ('e');
INSERT INTO playerz (player_name) VALUES ('f');
INSERT INTO playerz (player_name) VALUES ('g');
INSERT INTO playerz (player_name) VALUES ('h');

INSERT INTO player_recordz (player_id) VALUES (1);
-- INSERT INTO player_recordz (player_id) VALUES IN [1, 2];
INSERT INTO player_recordz (player_id) VALUES (2);
INSERT INTO player_recordz (player_id) VALUES (3);
INSERT INTO player_recordz (player_id) VALUES (4);
INSERT INTO player_recordz (player_id) VALUES (5);
INSERT INTO player_recordz (player_id) VALUES (6);
INSERT INTO player_recordz (player_id) VALUES (7);
INSERT INTO player_recordz (player_id) VALUES (8);
 #+END_SRC

 #+RESULTS:
 | DROP TABLE      |
 |-----------------|
 | DROP TABLE      |
 | DROP TABLE      |
 | DROP TABLE      |
 | DROP TABLE      |
 | CREATE TABLE    |
 | CREATE TABLE    |
 | CREATE TABLE    |
 | CREATE TABLE    |
 | CREATE TABLE    |
 | CREATE VIEW     |
 | CREATE VIEW     |
 | CREATE FUNCTION |
 | CREATE FUNCTION |
 | CREATE FUNCTION |
 | CREATE FUNCTION |
 | CREATE FUNCTION |
 | CREATE FUNCTION |
 | CREATE FUNCTION |
 | CREATE FUNCTION |
 | CREATE FUNCTION |
 | CREATE FUNCTION |
 | CREATE FUNCTION |
 | INSERT 0 1      |
 | INSERT 0 1      |
 | INSERT 0 1      |
 | INSERT 0 1      |
 | INSERT 0 1      |
 | INSERT 0 1      |
 | INSERT 0 1      |
 | INSERT 0 1      |
 | INSERT 0 1      |
 | INSERT 0 1      |
 | INSERT 0 1      |
 | INSERT 0 1      |
 | INSERT 0 1      |
 | INSERT 0 1      |
 | INSERT 0 1      |
 | INSERT 0 1      |
 | INSERT 0 1      |
 | INSERT 0 1      |
 | INSERT 0 1      |
 | INSERT 0 1      |
**** using OMW
 #+BEGIN_SRC sql :engine postgresql :database tourney_practice
CREATE OR REPLACE FUNCTION set_all_OMW() RETURNS VOID AS $$
       select * from set_OMW(1);
       select * from set_OMW(2);
       select * from set_OMW(3);
       select * from set_OMW(4);
       select * from set_OMW(5);
       select * from set_OMW(6);
       select * from set_OMW(7);
       select * from set_OMW(8);
$$ LANGUAGE SQL;
 #+END_SRC

 #+RESULTS:
 | CREATE FUNCTION |
 |-----------------|

 #+BEGIN_SRC sql :engine postgresql :database tourney_practice
-- select * from set_OMW(0);

 #+END_SRC

 #+RESULTS:
 | set_omw |
 |---------|
 |         |
 select * from set_OMW(3);
 set_OMW(2)
*** insert round one match datap
 #+BEGIN_SRC sql :engine postgresql :database tourney_practice
INSERT INTO match_participants VALUES (1, 1, 2);
INSERT INTO match_participants VALUES (2, 3, 4);
INSERT INTO match_participants VALUES (3, 5, 6);
INSERT INTO match_participants VALUES (4, 7, 8);
 #+END_SRC

 #+RESULTS:
 | INSERT 0 1 |
 |------------|
 | INSERT 0 1 |
 | INSERT 0 1 |
 | INSERT 0 1 |

*** insert round one match score results
 #+BEGIN_SRC sql :engine postgresql :database tourney_practice
INSERT INTO score_results VALUES (1, 0, 1);
INSERT INTO score_results VALUES (2, 1, 0);
INSERT INTO score_results VALUES (3, 0, 1);
INSERT INTO score_results VALUES (4, 1, 0);
SELECT * FROM log_records(1);
SELECT * FROM set_all_OMW();
 #+END_SRC

 #+RESULTS:
 | INSERT 0 1  |
 |-------------|
 | INSERT 0 1  |
 | INSERT 0 1  |
 | INSERT 0 1  |
 | log_records |
 |             |
 | set_all_omw |
 |             |

*** insert round two match info
 #+BEGIN_SRC sql :engine postgresql :database tourney_practice
INSERT INTO matchez (match_id, tournament_name, round) VALUES (5, 'tennis', 2);
INSERT INTO matchez (match_id, tournament_name, round) VALUES (6, 'tennis', 2);
INSERT INTO matchez (match_id, tournament_name, round) VALUES (7, 'tennis', 2);
INSERT INTO matchez (match_id, tournament_name, round) VALUES (8, 'tennis', 2);
INSERT INTO match_participants VALUES (5, 2, 3);
INSERT INTO match_participants VALUES (6, 6, 7);
INSERT INTO match_participants VALUES (7, 1, 4);
INSERT INTO match_participants VALUES (8, 5, 8);
 #+END_SRC

 #+RESULTS:
 | INSERT 0 1 |
 |------------|
 | INSERT 0 1 |
 | INSERT 0 1 |
 | INSERT 0 1 |
 | INSERT 0 1 |
 | INSERT 0 1 |
 | INSERT 0 1 |
 | INSERT 0 1 |

**** serially
 #+BEGIN_SRC sql :engine postgresql :database tourney_practice
INSERT INTO score_results VALUES (5, 0, 10);
INSERT INTO score_results VALUES (6, 10, 0);
INSERT INTO score_results VALUES (7, 0, 10);
INSERT INTO score_results VALUES (8, 1, 10);
select * from log_records(2);
select * from set_all_omw();
 #+END_SRC

 #+RESULTS:
 | set_all_omw |
 |-------------|
 |             |

**** 
 #+BEGIN_SRC sql :engine postgresql :database tourney_practice
SELECT log_home_losses(2);
SELECT log_home_wins(2);
SELECT log_away_losses(2);
SELECT log_away_wins(2);
SELECT log_draws(2);
 #+END_SRC

 #+RESULTS:
 | INSERT 0 1      |
 |-----------------|
 | INSERT 0 1      |
 | INSERT 0 1      |
 | INSERT 0 1      |
 | log_home_losses |
 |                 |
 | log_home_wins   |
 |                 |
 | log_away_losses |
 |                 |
 | log_away_wins   |
 |                 |
 | log_draws       |
 |                 |

***** example of new_countPlayers
 #+BEGIN_SRC python :session *Python* :results output
new_countPlayers("tourney_practice", "playerz")
 #+END_SRC

 #+RESULTS:
 : 3

***** def keyword_statement_string(table_name, sql_keyword):		:def:
 #+BEGIN_SRC python :session *Python* :results output :tangle yes
def keyword_statement_string(table_name, sql_keyword):
    tb_name = table_name
    sql_keywords = sql_keyword + """ """
    update_statement = sql_keywords + tb_name + """ """
    return update_statement
 #+END_SRC

 #+RESULTS:

 #+BEGIN_SRC python :session *Python* :results output
keyword_statement_string("matchez", "FROM")
 #+END_SRC

 #+RESULTS:
 : 'FROM matchez '

***** examples of new_playerStandings
 #+BEGIN_SRC python :session *Python* :results output
new_playerStandings("playerz")
 #+END_SRC

 #+RESULTS:
 : [(1, 'AAAA', 1, 1), (2, 'BBBB', 0, 1), (3, 'CCCC', 0, 0)]
***** def keyword_statement_string(table_name, sql_keyword):		:def:
 #+BEGIN_SRC python :session *Python* :results output :tangle yes
def keyword_statement_string(table_name, sql_keyword):
    tb_name = table_name
    sql_keywords = sql_keyword + """ """
    update_statement = sql_keywords + tb_name + """ """
    return update_statement
 #+END_SRC

 #+RESULTS:

 #+BEGIN_SRC python :session *Python* :results output
keyword_statement_string("matchez", "FROM")
 #+END_SRC

 #+RESULTS:
 : 'FROM matchez '

****** new--what are the columns we want? (assume points)
 #+BEGIN_SRC python :session *Python* :results output :tangle yes

def new_playerStandings(dbname, table_name):
    from_statement = keyword_statement_string(table_name, """FROM""")
    query = ("SELECT player_id, points " +
             from_statement + "ORDER BY points DESC;")
    return new_dbExecuteRetrievalWrapper_allrows(dbname, query)
 #+END_SRC

 #+RESULTS:



 #+BEGIN_SRC python :session *Python* :results output :tangle yes
new_playerStandings("tourney_practice", "player_recordz")
 #+END_SRC

 #+RESULTS:
 : []

******* registerMatch--correct
 #+BEGIN_SRC sql :engine postgresql :database tourney_practice
-- INSERT INTO matchez (match_id, tournament_name, round) VALUES (1, 'tennis', 1);
 #+END_SRC

 #+RESULTS:
 | INSERT 0 1 |
 |------------|

 #+BEGIN_SRC python :session *Python* :results output :tangle yes
def registerMatch(dbname, table_name, match_no, tournament_name, round_of_tournament):
    insert_statement = keyword_statement_string(table_name, """INSERT INTO""")
    query = (insert_statement + "(match_id, tournament_name, round)" + 
             "VALUES (%s, %s, %s);")
    new_dbExecuteWrapper(query, dbname, (match_no, tournament_name, round_of_tournament))
 #+END_SRC

 #+RESULTS:

 #+BEGIN_SRC python :session *Python* :results output :tangle yes
registerMatch("tourney_practice", "matchez", 1, "soccer", 1);
 #+END_SRC

 #+RESULTS:

******* log_player_records--must also use tournament_name?
    the round number
 #+BEGIN_SRC sql :engine postgresql :database tourney_practice
SELECT * FROM log_records(1);
 #+END_SRC

 #+RESULTS:
 | log_records |
 |-------------|
 |             |

 #+BEGIN_SRC python :session *Python* :results output :tangle yes
def new_countPlayers(dbname, table_name):
    DB = new_connect(dbname)
    c = DB.cursor()
    from_statement = keyword_statement_string(table_name, """FROM""")
    query = "SELECT count(*)" + from_statement + ";"
    c.execute(query)
    row = c.fetchone()
    row_item = list(row)
    DB.close()
    return int(row_item[0])
 #+END_SRC

 #+BEGIN_SRC python :session *Python* :results output :tangle yes
def log_player_simple(dbname, round_of_tournament):
    query = "SELECT * FROM log_records(%s)"
    new_dbExecuteWrapper(query, dbname, (round_of_tournament,))
 #+END_SRC

 #+RESULTS:

 #+BEGIN_SRC python :session *Python* :results output :tangle yes
log_player_simple("tourney_practice", 1)
 #+END_SRC

 #+RESULTS:

 #+BEGIN_SRC python :session *Python* :results output :tangle yes
def log_player_records(round_of_tournament):
    from_statement = keyword_statement_string(table_name, """FROM""")
    query = "SELECT *" + from_statement + "(%s)";
    new_dbExecuteWrapper(query, dbname, ())
 #+END_SRC

***** counting
  #+BEGIN_SRC python :session *Python* :results output :tangle yes
new_countPlayers("tourney_practice", "playerz")
  #+END_SRC

  #+RESULTS:
  : 2
****** create new table just for practicing inserting one column
 #+BEGIN_SRC sql :engine postgresql :database tourney_practice
CREATE TABLE fake_playerz (
       player_name text not null);
 #+END_SRC

 #+RESULTS:
 | CREATE TABLE |
 |--------------|

 #+BEGIN_SRC python :session *Python* :results output :tangle yes
conn = psycopg2.connect("dbname=tourney_practice")
cur = conn.cursor()
cur.execute("INSERT INTO fake_playerz VALUES (%s)", ("dipshitz",))
conn.commit()
 #+END_SRC

 #+RESULTS:

*** retrieve a select * call (how_many_players)
    :PROPERTIES:
    :ID:       A52FC1A6-0333-4B0F-B54F-2FAB13218B39
    :END:
use Python to call straight SQL retrieval queries (on player_recordz)
#+BEGIN_SRC python :session *Python* :results output :tangle yes
def how_many_players(dbname):
    query = "select * from player_recordz;"
    return new_dbExecuteRetrievalWrapper_allrows(dbname, query)
#+END_SRC

#+RESULTS:

#+BEGIN_SRC python :session *Python* :results output :tangle yes
how_many_players('tourney_practice')
#+END_SRC

#+RESULTS:
: [(1, 0, 2, 0, 0, 0), (5, 0, 2, 0, 0, 0), (2, 1, 1, 0, 3, 0), (6, 2, 0, 0, 6, 0), (7, 1, 1, 0, 3, 0), (3, 2, 0, 0, 6, 0), (4, 1, 1, 0, 3, 0), (8, 1, 1, 0, 3, 0)]
